In [37]:
import numpy as np
import pandas as pd

In [38]:
property_data = pd.read_csv('./property-data.csv')

In [39]:
property_data

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [40]:
property_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           8 non-null      float64
 1   ST_NUM        7 non-null      float64
 2   ST_NAME       9 non-null      object
 3   OWN_OCCUPIED  8 non-null      object
 4   NUM_BEDROOMS  7 non-null      object
 5   NUM_BATH      8 non-null      object
 6   SQ_FT         8 non-null      object
dtypes: float64(2), object(5)
memory usage: 632.0+ bytes

In [47]:
#缺失值处理
new_df = property_data.dropna()

In [48]:
new_df

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
8  100009000.0   215.0    TREMONT            Y           na        2  1800

In [49]:
#缺失值处理字段
new_sub_df = property_data.dropna(subset=['ST_NUM'])

In [50]:
new_sub_df

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
3  100004000.0   201.0   BERKELEY           12            1      NaN   700
4          NaN   203.0   BERKELEY            Y            3        2  1600
5  100006000.0   207.0   BERKELEY            Y          NaN        1   800
7  100008000.0   213.0    TREMONT            Y            1        1   NaN
8  100009000.0   215.0    TREMONT            Y           na        2  1800

In [51]:
#缺省值填充
new_fill_df = property_data.fillna('123456')

In [52]:
new_fill_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1    1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5      --
2  100003000.0  123456   LEXINGTON            N       123456        1     850
3  100004000.0   201.0    BERKELEY           12            1   123456     700
4       123456   203.0    BERKELEY            Y            3        2    1600
5  100006000.0   207.0    BERKELEY            Y       123456        1     800
6  100007000.0  123456  WASHINGTON       123456            2   HURLEY     950
7  100008000.0   213.0     TREMONT            Y            1        1  123456
8  100009000.0   215.0     TREMONT            Y           na        2    1800

In [53]:
#指定列填充
new_y_df = property_data['ST_NUM'].fillna('123456')

In [54]:
new_y_df

0     104.0
1     197.0
2    123456
3     201.0
4     203.0
5     207.0
6    123456
7     213.0
8     215.0
Name: ST_NUM, dtype: object

In [62]:
#均值,中位数,众数填充
df_mean = property_data['ST_NUM'].mean()
new_mean_df = property_data[['ST_NUM']].fillna(df_mean)

In [63]:
new_mean_df

       ST_NUM
0  104.000000
1  197.000000
2  191.428571
3  201.000000
4  203.000000
5  207.000000
6  191.428571
7  213.000000
8  215.000000

In [68]:
df_mode = property_data['ST_NUM'].mode()
new_mode_df = property_data['ST_NUM'].fillna(df_mode)

In [69]:
new_mode_df

0    104.0
1    197.0
2    201.0
3    201.0
4    203.0
5    207.0
6    215.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [70]:
df_median = property_data['ST_NUM'].median()
new_median_df = property_data['ST_NUM'].fillna(df_median)

In [71]:
new_median_df

0    104.0
1    197.0
2    203.0
3    201.0
4    203.0
5    207.0
6    203.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [72]:
#重复值删除
person = {
  "name": ['Google', 'Runoob', 'Runoob', 'Taobao'],
  "age": [50, 40, 40, 23]  
}
df = pd.DataFrame(person)

In [73]:
df

     name  age
0  Google   50
1  Runoob   40
2  Runoob   40
3  Taobao   23

In [74]:
df.drop_duplicates()

     name  age
0  Google   50
1  Runoob   40
3  Taobao   23

In [75]:
#数据格式转换
data = {
  "Date": ['20201201', '20201202' , '20201226'],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data)

In [76]:
df

       Date  duration
0  20201201        50
1  20201202        40
2  20201226        45

In [77]:
df['Date'] = pd.to_datetime(df['Date'])

In [78]:
df

        Date  duration
0 2020-12-01        50
1 2020-12-02        40
2 2020-12-26        45